[
  {
    "reviewerName": "CindyLouWho68",
    "rating": 5,
    "title": "Very smart smart-lock!",
    "location": "the United States",
    "date": "September 9, 2025",
    "verifiedPurchase": true,
    "reviewText": "This is a great lock. The fingerprint reader is a definitely a plus and works for me everytime. Other household users have a little difficulty, but I'm sure it is simply user error or they just don't have good scannable fingerprints. Yes, that is a thing... my mom's fingerprint won't work for anything, even her phone. The BEST feature is the Auto-Unlock. I don't have to do anything and it unlocks as I approach. I have it set to turn the status light on, so that I'm sure it has worked. The ring around the fingerprint reader turns green. I have to add that auto-unlock did not work correctly when we first installed so if I had written this review when I 1st received the smart lock, it would have been much different, however, Customer Service was terrific! They had me try a few things and after a few days - I'm on the East coast, they are the West coast, so time difference - and a firmware update, it works perfectly.  The app is very intuitive and easy to use as well. I can unlock 5 ways:* Auto-unlock as I approach the door* Numeric Code - can have multiple for different users. You can also set temporary codes, or schedule based codes* Fingerprint - multiple for different users* App controlled* Old School keyI'm very pleased with my purchase. I definitely recommend and would repurchase myself.",
    "page": 1
  },
  {
    "reviewerName": "S",
    "rating": 5,
    "title": "Easy to use fingerprint lock",
    "location": "the United States",
    "date": "August 30, 2025",
    "verifiedPurchase": true,
    "reviewText": "Great functional lock for families with kids at a good price. It reads thumbprints consistently well even with wet hands. Young kids can unlock the door themselves with their fingerprints, so it’s been especially great on our back door for letting our kids have the freedom to play outside by themselves without worrying about leaving the door unlocked after or getting locked out. We set it to have auto lock, but it’s also easy to manually lock. Kids also unlock the door when we get home. Was easy to install and set up. Adding a temporary code on the app is really easy. Looks nice paired with a kwikset door handle/pull. We only have poor signal connection for our bridge but so far it seems to work well anyway, never anny network issues and the battery is still high after a month. The only feature I didn’t end up liking was the Auto Unlock mode. We drive behind our house on the way home and I got a notification that it would unlock when we were still around the block. I turned that off without troubleshooting it because the other features are so good that we didn’t need that feature.",
    "page": 1
  },
  {
    "reviewerName": "Alex.",
    "rating": 5,
    "title": "A great improvement over the Schlage smartlock zwave version",
    "location": "the United States",
    "date": "November 17, 2022",
    "verifiedPurchase": true,
    "reviewText": "This is a great little smart lock. My only issue with it was with the installation, as for whatever reason if the bolt does not go all the way you get a doorlock jammed error, and the remote functions of the door are halted until it gets \"unjammed\".Basically you need to make sure your the hole in the door frame has at least 1\" depth or you will keep getting the door jammed error message and will be only able to open the door locally. Not only that but while the door is the jammed state you keep getting an annoying beep that will make you fix the thing really fast.With the bad stated, all other functions are really nice. You can add users remotely and provide them access with a code or through the app, which is very neat. Those users can be main users or temporary ones. The main users will have access 24/7, while with the temporary ones  you can assign particular times at which they are allowed to open the door. Very nice.The title of this review makes a reference to the Schlage smart doorlock because I bought one of those a few years ago, and while it served me well, it doesn't come close to the features of this unit. For once, you cannot add users remotely. Actually, there are actually no users in my version of that doorlock. You simply provide codes and cannot eliminate access to those codes as you wish, which leaves that smart doorlock with way fewer use cases than this UltraLock.Connecting to the wifi dongle was fast and I made sure to create a Wifi network with 2.4Ghz only. I was once a network engineer (I actually wrote that I am a network engineer and went back and used the past tense because it's been a while since I was in that profession) but I am quite sure mostly any apt technology user will be able to install it.The physical installation is as easy as any other traditional, non-smart door lock. If you can manage to install a doorlock you will be able to install this one because it is the same.As for usability and functionality, The users haven’t had any complaints. My mother and sister bought units for them because they liked this so much.Some reviewers have mentioned issues with the fingerprint reader. Often I have to put my finger twice before it recognizes it. Nothing more. For me, it works perfectly as moving the finger a bit is nothing to me, because the doorlock lets you know immediately that it failed to recognize the fingerprint and you immediately are allowed to put the finger again for a second read that almost always final.Before I was able to setup my fingerprints at my mother's house I used the app to open the door and it was also a breeze. Work perfectly, no problems at all. The firgerprint is faster and more convenient obviously and will be the preferred option for those users with unrestricted access to the house.You can also set passcodes to users and there is a neat functionality that adds security and it is that you can type phantom numbers in the code and the doorlock picks the correct numbers and authorizes access. When I say phantom numbers is that if for instance your access code is 12345, you can type xxx12345yyy (with xxx and yyy being any 0 to 9 digits) and the doorlock will recognize the proper access code and will open. This is useful and a very good security practice as peakers and potential intruders will have a harder time figuring out your passcode, as would those potential intruders trying to figure out your codes based on the wear of the buttons (the most used numbers are likely to show more wear than those not used).What else? I think this it. As you can see, the product is not perfect but it is close, and it doesn’t warrant to deduct a star because it is way better than a 4 out of 5 stars product. If I could give the product a 4.8 stars rating, a solid 95.Highest recommendation as you will be able to let people in to your house from anywhere, and will also be able to stop allowing them to come in. This is golden to those with homes or apartments being rented for short term stays and those living alone who need to grant access to personnel for whatever reason. Only being able to add users and give them specific times to get in is just way too cool of a feature. Great job.",
    "page": 1
  },
  {
    "reviewerName": "jforbz",
    "rating": 4,
    "title": "Excellent, responsive customer service.",
    "location": "the United States",
    "date": "July 5, 2025",
    "verifiedPurchase": true,
    "reviewText": "First, I purchased this lock in November of 2024, but just got around to installing it at our beach place about a month ago.  I have three other, different model U-Bolts on various doors at our primary home - they have all worked well for almost a year.  Installation was simple and quick.  The lock functions well except for the fingerprint function, which was also a bust on the other \"print capable\" locks that I have.  I don't use that feature, so don't really care.  This is the first U-bolt I have had with the WiFi bridge as opposed to built-in WiFi, and I have found it to be practically useless.  I was initially ablr to get the bridge paired to the lock and access the lock via WiFi; however, this lasted for about a day, and has been completely useless since then.  I have restarted the lock (removed and reinserted batteries), restarted the bridge, repeated both in reverse order as well as simultaneously, unpaired and repaired the bridge, yada, yada, yada.  None of this has helped.  The app insists that the bridge is paired, but always times out when I attempt to activate the lock remotely to cycle it or program a new access code for a guest or family member.  All works well for programming/activation when I am in BT range, but I live 300 miles away, so a bit too far for BT.  Should have bought the built in WiFi version that I already knew worked, but this one was cheaper.  Live and learn.  Beware the bridge!Update:  U-Tec Customer Service responded to my review, upgraded the bridge firmware remotely, fixed whatever was causing the problem, and made my lock functional.  This all occurred without my making any direct contact with them, and in just three days time. I am now very happy with the lock, and quite impressed with CS.",
    "page": 1
  },
  {
    "reviewerName": "HRC",
    "rating": 5,
    "title": "Love the Lock, Ease of Use, & Customer Service/Support When Needed",
    "location": "the United States",
    "date": "September 2, 2025",
    "verifiedPurchase": true,
    "reviewText": "Very happy with product & service from the company.First purchased a lock for our Rental unit in Scottsdale, so we could remotely program the front door for our guests.Later, when we needed to replace the locks on our own home, decided that we liked the U-tec lock with the ability to control via App, program for multiple people to have their own codes, that we decided to get a second U-tec lock for our home in Wisconsin.Product arrived, installed, working well for about 2 months, but something happened & the lock stopped working.  I contacted U-tec customer service & they were very responsive to help us see what the problem was, and after a few follow up e-mails to clarify, they sent us a replacement for the interior part of the lock which worked perfectly.Both my original lock in Scottsdale (have had for years), and now my newer lock (this purchase) are both working perfectly, I am very much impressed by the responsiveness of customer service & support.  I also really like their App that remote controls the locks, as they offer multiple methods to \"open\" the lock (programable pins, fingerprints, use of App, etc.), can keep a record of who & when the lock was used, can specify dates & times the lock can be \"accessed\" by the codes/accounts assigned, and as temporary users for our guests.",
    "page": 1
  },
  {
    "reviewerName": "Sean",
    "rating": 5,
    "title": "Four Ways to Unlock With NO Monthly Fees?! Now THIS is the Smart Lock You've Been Looking For!",
    "location": "the United States",
    "date": "October 27, 2020",
    "verifiedPurchase": true,
    "reviewText": "Let's keep this really simple - just get this lock. Why you ask? Fine, fine, I guess I should explain the *why* behind getting this lock. But be warned, this is a long review...Truly, the U-Bolt Pro is everything a lock should be - literally. By biggest gripe with smart locks is that they usually have two features - some sort of key manual access and then some sort of technology. Maybe it's a key unlock and a smart phone app, or maybe it's a key unlock and a number pad, or maybe it's a key unlock and a finger print reader. But this lock, my friends, has *all* those things.First off, in case anyone has not said this, you CAN get this lock rekeyed to match your existing set of keys. I love, love, love this - now I do not have to be stuck with some new random key for the deadbolt in addition to my current house key. The strange thing is, while the manufactures site states that this uses a Schlage style barrel, it actually uses a Kwikset key? Odd right? The locksmith I had rekey the barrels (which yes, you can remove from the lock and can take to your local lock smith!) was baffled as well. Personally this was not an issue for me (more of a great surprise actually) as I already had Kwikset keys on my house, but if you were expecting Schlage then you'd be disappointed as the barrel does not work with them. I assume one could buy a Schlege barrel and place it in the lock... however my locksmith warned against this as the tail is quite long on the included barrel and he did not believe there were any Schlege style barrels with such a long tail. So your mileage may vary - but TL;DR, this lock can be rekeyed to Kwikset keys!But back to what I was saying - I cannot, I repeat cannot, understate how important the all-the-above options to unlock the deadbolt was to me. You have SO many choices to unlock the door - and yes at first that might sound silly - but trust me, it's great. Especially for people like my parents who do not want to use a smart phone app.Let me give you a general run down of how all these features have made my life simpler. When I pull into my neighborhood, the app alerts me that the locks are ready to unlock when I approach my house. And when I pull into my driveway, the locks instantly unlock so I do not even have to take the keys out of my pocket to get inside. And when I finally step into the house, the locks (after a set amount of time I preconfigured) will auto lock behind me. Just like that, with my hands full of groceries, I did not even have to pull the keys or my phone out of my pocket. Wow. And this becomes exponentially better when it's raining and I am not fumbling for my keys to unlock the door! I can just run inside barely getting soaked! Now it's not always perfect, maybe once or twice a month I have a Bluetooth issue where the lock does not detect I'm there but hey, I can stomach that inconvenience - especially when you have other options to unlock the door.Leading to my next comment - the fingerprint and pin pad unlocking. Maybe I left my phone at home or perhaps the lock did not detect me at the door. No problem, finger print scanner to the rescue. Just one two second hold with my finger and the door unlocks without a hitch! And when I've had gloves on and that's not an option, I can unlock the door with the number pad. Also FYI, these are the two methods my parents prefer the most - they don't want to have the app on their phones, but they also would like for a way to unlock the door without having to fumble with a key. A fingerprint or a number code stored locally on the device (that can work even without Wifi!) is excellent for them. Now if you want to unlock the device from the app when say you're at at work for example and no where near your house, you will need the bridge - but otherwise the device functions entirely on Bluetooth locally.If all else fails - my phone did not connect, the finger print reader was not reading my thumb for some reason, or perhaps the lock is dead and the number pad cannot function - I can just flip down the lid and insert my traditional house key. Did you count that? There are FOUR different ways to unlock this deadbolt! And did I mention there are NO MONTHLY FEES fees for this?!Okay okay look I concede, it's not all sunshine and rainbows. There's one eency weency issue: Alexa and this lock hate each other. Perhaps this can be fixed with a software update... but the issue still persists to this day for me. Now the lock will pair fine with Alexa, and I can even ask Alexa to unlock the device or lock the device with my voice. But, that's where the problem begins. First you have to tell Alexa a pin to unlock the deadbolt... which seems crazy to me. Yes I know, the whole point is so that no one can just shout \"Alexa, unlock the front door!\" from outside your house and the Alexa device inside hears the command and unlocks... but also, I really would prefer not to have to tell Alexa a pin every single time, especially when other people around me outside could hear such a pin. However honestly it wouldn't matter if they did hear my pin as, surprise, Alexa cannot unlock this lock! She will lie to you and say she has but oh no, do not believe her beautiful voice - she is a liar! The Alexa app will say the door is unlocked too, but that is also false. It simply just does not work with Alexa - and if that is something incredibly important to you then this may not be the lock for you. With that said, I really don't believe it should be, though; I never once felt the need to unlock the deadbolt with Alexa nor ever found the idea more convenient than using the location proximity/the app, my fingerprint, the number pad, or the key itself. Maybe it would have been nice when I'm already inside to make sure the door is locked, but isn't that what the auto lock feature or the app is for already? And I guess this issue could be solved down the line with an update too, so maybe by the time you are reading this the whole paragraph is a nonissue!Wow, I typed a lot here - though when you're spending almost $200 on a lock, you want to make sure that your money is going towards a good investment. I can confidently say that yes, it absolutely is - heck, I bought three of them, dropping more than half a grand... and without a doubt, it's been 100% worth it. If you want a lock with multiple smart unlocking options, a physical key option, and no monthly subscription, you found it. Installation was simple too! I just really, really, really like this lock if you can't tell by now - and I hope you will too.",
    "page": 1
  },
  {
    "reviewerName": "LMZ",
    "rating": 5,
    "title": "Outstanding value for the price",
    "location": "the United States",
    "date": "September 13, 2025",
    "verifiedPurchase": true,
    "reviewText": "The Ultraloq materials seem to be high quality with a sturdy design. This replaced an existing keyed deadbolt and it fit perfectly into the existing hole with no addition drilling required. It took less than 15 minutes to install using just a Phillips screwdriver.I downloaded the free U Home app and used it to program the main code and two fingerprints for myself.I like the multiple ways to unlock the Ultraloq: 1) fingerprint, 2) code, 3) app, 4) shaking my iPhone, and 5) Auto Unlock when I approach the door. The lock can also be set to auto lock when I leave or after I enter thru the door.Time will tell how long the 4 AA batteries last or the fingerprint reader will resist wear and weathering, but my initial evaluation is this product is a superb value with a lot of features at an affordable price point.",
    "page": 1
  },
  {
    "reviewerName": "justinbooth",
    "rating": 4,
    "title": "Great lock with lots of features.",
    "location": "the United States",
    "date": "July 21, 2025",
    "verifiedPurchase": true,
    "reviewText": "So far I'm really loving the new lock. It works as advertised. Each family member has their own personal code and thumb prints registered for the lock. I also love that you can add temporary access codes for users with limitations on the amount of times they can use the code and the precise dates and times the code will be active. Perfect for a regular cleaner or a repairman visit. The household adults have it synced to unlock based on proximity to our phones. This feature requires connection to the internet.That is why I only rated 4 stars. The Wi-Fi functionality was not working when I initially installed the lock. I contacted customer service and they had me trouble shoot a couple of things. Then they informed me that I may have a bad electronic mechanism of the lock and they would need to send me a replacement. The next day I received an email stating the lock should work correctly now. So it appears there is something that needed to be configured on U-tec's side of things. I was able to connect the lock and it works great.Installation and setup was fairly easy with the exception of the Wi-Fi issue stated before. It's not the most sleek or discreet unit but it look really nice and the quality seems to be great.",
    "page": 1
  },
  {
    "reviewerName": "Uncle Jub",
    "rating": 4,
    "title": "Rough Start But Very Pleased Now",
    "location": "the United States",
    "date": "August 15, 2025",
    "verifiedPurchase": true,
    "reviewText": "I originally bought this lock because of a promotion Ultraloq was having but then found out that, because I was one of the first people to order it, I got it at no cost. I'd been seeing their advertisements for quite awhile and was quite intrigued so I was excited to get it installed.The installation was simple. I have installed door locksets before so I had an advantage there but, seriously, all it takes is a screwdriver. The instructions were thorough and there are videos available on the internet as well. Less than 30 minutes and it was installed.I then installed the app (iOS). Connecting the lock to my Wi-Fi was where things started getting difficult. I know it wasn't a distance issue because I have items further away from my router that connect fine but the Ultraloq would connect, disconnect, rinse and repeat. I also had issues with the automatic locking feature and with getting the firmware to update. I contacted Ultraloq support and ended up working with them for months; and that is not an exaggeration. They ended up sending me two new interior lock assemblies and one whole new lock. One of the interior assemblies was DOA but the other items, while they might have fixed one issue, only induced another. I don't know if it was because this was a new product or if it was something else. But kudos to their tech support for always being available and never giving up on their commitment to make it right. Eventually, I ended up with a working lock and I love it. No more worrying about anyone leaving the door to the house unlocked, no worrying if I have a housekey when I'm outside and no worries about the batteries failing because, worse case, I can use the backup key to get in. (Or I can connect a micro-USB power source and get in.) And it tells you when the batteries are low so no excuse for them to ever fail completely.The battery life has been great. This is the primary door we use to go into the house from the garage and it is opened and closed many times a day. This lock uses four AA batteries and they last well over six months. I wish it had a rechargeable battery pack (for environmental reasons) but, at the most, I need to change them twice a year and that's with very heavy use.I primary use the fingerprint feature to open the lock. So easy! And I also have a backup code I can use if for some reason my fingers are too dirty from working outside to be able to use that. There is also the auto unlock feature (app access) that can be enabled that, if you come near with an enrolled phone, automatically opens the lock. I tried that but it seemed to take just a little too long to register that the phone was near and to open the door. But I'm not known for my patience... I should probably try it again but, honestly, the fingerprint option works great for me..Oh, and you can set different people up with access using a code, fingerprints (It accepts two for every person so if one is unavailable (dirty, bandaged, etc...) you can use another finger.), and app access or any combination thereof. Lots of options depending on the individuals' needs and preferences.I don't know that I would have bought this at full price because I didn't really \"need\" it. However, if I had school-age kids or a short-term rental, this would be a great solution that obviates the needs for anyone to keep up with a key. And codes can be added through the app remotely so you don't have to be near the lock to do this. Also, it also keeps a history of opening and closing and who did it (based on their code, fingerprint or device they used). Again, not real important to me but, especially for a short-term rental, this could be almost a necessity.So, again, after a lot of blood, sweat and cursing (to myself), I think I ended up with a pretty solid product. )Occasionally, the lock starts notifying me that it auto-locked when it was already locked. But I just take out the batteries and reinsert them and that gets it back on track.) I was impressed that they sent me, at one point, a whole new lock. Stuff happens but it's how you respond when it does that people remember. And they get high marks for how they handled the problems I encountered.",
    "page": 1
  },
  {
    "reviewerName": "Minxy B",
    "rating": 4,
    "title": "Outstanding device.  Key-free, Worry-free, Teenager-proof",
    "location": "the United States",
    "date": "March 13, 2020",
    "verifiedPurchase": true,
    "reviewText": "The best purchase I made for my new home.  I no longer have to deal with teenagers always forgetting or losing my keys.  The Ultraloq does what it claims with the exception of the bluetooth unlocking feature as my phone nears the door.  More on that below.  All of the other features are great:  fingerprints, codes/profiles, unlock from anywhere via the wi-fi bridge, auto-lock feature, etc.  It does it well.Pros:1) Fingerprint:  I find that I use the fingerprint unlock the most.  Never a misstep. It takes your fingerprint from every angle so you can be assured that your fingerprint works correctly each time.  I've set up myself and my son for this and no issues with unlocking.2) Auto-lock:  As I get busy and older, I lose most of my marbles or I find I'm developing OCD tendencies to check if I locked the door every few mins because I just KNOW I forgot something I did 20 secs ago.  I don't think about it anymore.  The door locks with a 30-sec delay and that's that.  To note:  My neighborhood has recently had thieves put rubber bands on the pull handle that would prevent a door lock from engaging.  The locking mechanism for the bolt and the door handle are separate so I don't have that worry.  And no longer worried about my forgetful absent-minded teenager or myself.  Completely worth the price for that alone.3) Codes/random input:  I don't use this often because i'm lazy but I have used it and works well.  I set up normal users for the home, a code/key for family that I trust, a code/key for temporary use (i.e. electrician that needs to drop in while I'm away, etc.).  what every the reason, I can set up multiple codes/keys, assign them appropriate access and length of time to use it.  I recently put this into action when I had my internet installed and provided my technician a code to use so I didn't have stand near the door as they went in and out.  I have used the random input (hitting numbers with the correct code buried in).  Works as intended.  I can see this working well for those in an apartment or townhouse setting with many people coming by, but on the front porch of my home with nary a visitor much less passerby on the street that is yards away, It's not a concern for me.  I'm just happy the option is there should I decide to move and take this with me to an environment like that again.4) Wi-fi Unlock:  Another feature I was very excited about.  My car has this feature and I can start my car that's parked at the airport while I'm away in Turkey.  Works the same.  The kit comes with the wi-fi bridge.  Once connected and set up on the wi-fi, the feature works.  I've tried this while I was in another state and my aunt dropped by so I can test it. One caveat is that it does not work on the 5 ghz spectrum of your wi-fi; just 2.4.5) Battery:  I have cons about this, more below.  However, this was a saving grace as well.  During a power outage on my block, the only thing working was this door lock and the security panel that has a battery built in for emergencies.  Because it's not hardwired, I was able to get in and out.  And now that I leave my key behind ( I need to change that), we would have been locked out otherwise.  Again, worth the price.  It also comes with the option to charge the lock via a USB connection but I don't regular carry a powerpack around to provide it juice should this happen.  just make a regular maintenance to change the battery (my recommendation is every 3 months/quarterly) and this shouldn't be a worry.6) Installation:  It was easy peasy.  The instructions were more than adequate, including the illustrations provided.  I've never installed a door lock before and I had ZERO issues with doing this.  I did take a look at a you-tube video prior but it was unnecessary as the instructions were detailed. I did change out the cylinder to a more secured key and that process was super easy too.  I don't ever have to worry about hiring a locksmith unless I'm truly locked out (which I will rectify soon).7) Physical key:  This was a deciding factor in my purchase.  I still wanted to use my key on the off chance of a power outage, battery failure, etc.  Being locked out of your home is no fun.  I did change out the cylinder to a more secured key and that process was super easy too.  I don't ever have to worry about hiring a locksmith unless I'm truly locked out, which I will rectify soon by putting the key in a location outside my home.Cons:1)  The  bluetooth unlocking feature as my phone nears the door does not work as claimed.  I can't say if this feature simply doesn't work or if it's just my signal as I live in a virtual dead-zone in my neighborhood (i.e.  I have to be on wi-fi calling while in my home), but it's a no-go for me.  I don't complain much about this because all the other features work so well but I wish this did as I hate having to push a code or use my fingerprint when I'm carrying a dozen grocery bags.  And I'd rather carry 25 grocery bags than make multiple trips the car.  It's one of the features I was most excited about (says every mom ever).2) The push notification telling me that U-tec bolt is jammed when it's not.  I don't know the cause of this.  Some times, it correctly identifies a jam (i.e., I didn't close my door completely flush or I left it ajar when the auto-lock function activates).  Most times, it doesn't.  It hasn't impeded the security system from activating so I just simply take a look if I'm home and dismiss the notification.  I know when i'm leaving, if I'm in a hurry, i just push the ultraloq button on the bottom of the pad to lock it and I hear the lock engage. Most times, I just close the door firmly when leaving and I'm confident in knowing the door is flush for the lock to engage on the auto-lock timer.3) It will drain batteries far quicker than advertised.  I installed my Ultraloq 11/29/2019 and it need new batteries by 3/1/2020.  Far less than the 6 months advertised.  And I didn't use the batteries provided.  I used a fresh pack of Energizer Max.4) Pairing the wi-fi brige was a beast.  It only works on the 2.4 spectrum of the network so I had a lot of issues with the set up as my phone only registers/prefers the 5 ghz spectrum.  It took much longer than it needed for the app to recognize the bridge.  I had to close and open it multiple times in order to get it work.  Once done, it was fine.  However, I recently changed providers and it wasn't easy to change the network in the app.  Very difficult.  I had to nearly delete the app or reset.  However, just going in, removing the bridge function and re-initiating it allowed me to set up on a new network.  Not coolI cannot comment on integration with Alexa or Google.  It's my plan in the near future to integrate with both in order to have a hybrid system.  It doesn't integrate with my security system (ADT) but I knew that prior to purchase so it's not a con for me.  Once I do integrate, I'll update my review.  Because I''m able to use the U-tec app to lock the door, it's a workaround of the integration for now.In all, it is an outstanding device and just what I needed.  Despite the cons I listed, I don't really have much to complain about as the pros outweigh this for me.  I feel secure in and out of my home with it so it's one less worry that I have, especially as person that travels so much.  I chose this device over others because of the features this one has that would provide me multiple ways to access my home.  Namely the battery and physical key.  Knowing that power outages happen, I didn't want to be left out in the cold one day that I'm least expecting it.  Also, coming from years of apartment living, my son loses keys and fobs ALL THE TIME.  The money I've spent replacing these are staggering.  I didn't want to deal with this again.I love this product.  It didn't receive 5 starts because of the cons I mentioned. It's not a perfect product or it's not perfectly working for me.  However, it works exceptionally well and would be a great product to use anyone's home for peace of mind.  Please note: My review is not endorsed, sponsored, paid for, or anything else that would signify a monetary exchange.  I don't often leave reviews (something I should change since I rely on them) but I was compelled to do so especially after recent events at my own home that tested this purchase.",
    "page": 1
  },
  {
    "reviewerName": "David W.",
    "rating": 4,
    "title": "A decent lock but it didn't blow me away, nor does the auto unlock work well...",
    "location": "the United States",
    "date": "August 29, 2025",
    "verifiedPurchase": true,
    "reviewText": "This lock works pretty well.  I was expecting a bigger upgrade over an older smart lock from a well known name brand in the lock industry, since that one was a solid 5-6 years old.  I do like the fingerprint reader on this lock, though you must get your finger pretty dead on based on how you set it up originally.  It can take a few attempts at times to get it to read correctly, and I've tried redoing the fingerprint setup to see if that would help, but it performs about the same each time.The one function I really wanted to work was auto unlock, and it has only worked once, and by the time it unlocked, I had already came through the door, locked it, and then it unlocked about 30 seconds later.  I don't know if it's because I'm on the Apple platform or what, but that function is garbage in my opinion.  I've tried messing with it (I was in IT for 29 years), and it still doesn't seem to function correctly.I also don't like the tacky door sensor that gets snagged on things.  I think this could have been implemented in a more integrated manner, like incorporating something into the deadbolt lock reinforcement on the door jamb side, but it looks tacky and I've already bumped it a few times based on where you need to place it.Would I buy this again knowing what I know today?  Probably not, but it works decently enough that I kept it and didn't return.  That wasn't because it was massively better than my old lock, but more so because I didn't want to hassle with uninstalling it.  YMMV.  I\"m giving it 4 stars, but honestly it's more like a 3.5 to me.  I rounded up.",
    "page": 2
  },
  {
    "reviewerName": "Jim",
    "rating": 3,
    "title": "Mostly great with a couple of potential deal breakers",
    "location": "the United States",
    "date": "July 4, 2025",
    "verifiedPurchase": true,
    "reviewText": "First, the good:Physical installation was a breeze. In my case, I installed this on a very standard exterior door. If you've ever installed a deadbolt, this is no different. Before installation, I set up the lock on my desk and made sure everything was oriented correctly and working properly.Setup on the app is straightforward. I found the process to be very intuitive.It's a really nice looking lock. I installed it on a black exterior door, and it's money.The fingerprint function is very convenient. It's not perfect, so don't expect it to be as bulletproof as Apple's TouchID. It does seem secure, though, and it works for me 9 times out of 10. 10% of the time I have to try again and it works the second time.The code function just works. Not much to say there.The build quality is pretty solid, but could be improved. The exterior side seems adequately robust. It's not going to keep a determined criminal out, but then neither will a standard deadbolt. The interior side, especially the knob to manually operate it, has some lightweight plastic that feels cheap. The electronics look to be high quality, and the connector between the two halves is a snug fit, which is good.The lock cylinder, based on my research, is slightly smaller than a standard core. Also based on research, it can, however, be changed out with an Emtek cylinder with minimal modification. Why would you do this? If you want a Schlage compatible key to work in it and you want to rekey it alike with the rest of your house's locks. I have a cylinder on order but have not tried this yet.The potential deal breakers:There's no provision for a door sensor, unlike other models from the same company, and this is not obvious when you're making a buying decision. You've got to be kidding me! It's literally a magnet and a reed switch, and they omitted that feature from this model. Some bean counter in a conference must have thought, \"this is a feature that we can charge extra for\" without thinking things through. Why is this terrible? It means that in my case, auto lock has to be disabled. When someone opens the door and, for example, leaves it open to bring in groceries, after 30 seconds or the time you configure, auto lock engages the deadbolt. The door is still open, so now the bolt is sticking out. If someone isn't paying attention and closes the door without looking, the deadbolt slams into the door frame. This is a baffling, infuriating, and quite deliberate design failure from a usability standpoint. It's annoying enough that I will probably return this.The Android app is laggy and sometimes doesn't cooperate. I have this installed on the exterior door of my home office, which is a finished room in my barn. I installed this in part because I have a sneaky child that would steal my keys and poke around in my office. That child is then obviously not configured as a user.When they knock on the door and I want to let them in without getting up, I'll try to unlock the door with the app. Almost every time I open the app and try to unlock the door, it will do nothing and time out after a few long seconds. My guest is waiting outside, perhaps impatiently, and not understanding what's going on. I have the WiFi bridge configured on the most overengineered home network in existence, I'm across the room from the lock, yet it still won't open immediately. Usually it goes through on the second attempt, but that's frustrating as heck.I won't lie: I'm disappointed and a bit frustrated that I will have to spend a little more on a model that supports a flippin' door sensor magnet. 🤦",
    "page": 2
  },
  {
    "reviewerName": "Leigh Campbell",
    "rating": 5,
    "title": "Best thing I've ever bought for my home!",
    "location": "the United States",
    "date": "September 11, 2025",
    "verifiedPurchase": true,
    "reviewText": "I love it! Highly recommended to everyone!I definitely think it is useful for older or disabled family members for emergency services to access your loved ones! This comes with the wifi bridge that you can control from anywhere. Example if your mom fell and called you to call 911 you could call 911 for her and let the firemen/ems in with the app just hit unlock when they get there. Or if your mom is on the floor and calls 911 she can unlock the door from her phone and let them in when they get there. You could also program a number that you give the dispatcher that could let them in if you didn't buy the wifi bridge.You have a middle school age child that forgot his key or lost it. Not with this everyone gets a code. No more rushing home or making them wait in the cold/ heat for someone to get there.It's just wonderful!",
    "page": 2
  },
  {
    "reviewerName": "Carlos",
    "rating": 5,
    "title": "Great Replacement to August Smart Lock!",
    "location": "the United States",
    "date": "May 18, 2021",
    "verifiedPurchase": true,
    "reviewText": "I start this review talking about August Smart Lock, but it is about ULTRALOQ U-Bolt Pro WiFi, so keep reading.I’ve had an August Smart Lock 3rd gen for about 4 or so years and it had pretty much worked flawlessly all this time until about 2-3 weeks ago when it started doing something weird where it would sort of ‘over turn’ when opening and it’d sort of get stuck there. Then it would not close again until you’d manually get it unstuck.Problem is that it wouldn’t even notify you that the lock was unlocked as it was customary for my smart notifications setup to let me know if door was open or unlocked for more than 5 minutes.I struggled as to what to do because I really liked August, but I had my fill of these constant failures where you’d leave thinking you had locked the door and it hadn’t only to come back home and find it unlocked.Finally, I did one last attempt by trying to contact their customer service for guidance, and after 2-3 times of holding on the phone for 30-40 minutes and not being able to get anyone, I decided they were no longer the kind of company I wanted for me if that’s the type of support they now provided - originally that wasn’t the case.My dilemma now was which new smart lock to get? So many out there that seem promising, but not really at the adequate flawless performance level I was used to with August, which auto-unlocked the door as I got home without having to have the app open, and knew when the door was closed so it’d auto-lock it or alert me that door was ajar, etc.After a lot of research, I came across U-Tec’s ULTRALOQ U-Bolt Pro WiFi - it had everything (without 1 minor item - door sense to know if door was ajar/closed). More importantly, it had a PHYSICAL KEY, in case I ran out of batteries (however, it even has a USB port for charging if that happens); it had a keypad, and most importantly, it had a FINGERPRINT READER.However, all that is meaningless if the app, tech support, features and/or dependability aren’t there; so some more research showed they were good quality and reliable and watched videos showing how fast fingerprint reader was, so I decided to try it.I hit the jackpot - product came, it was good quality, and fingerprint reader is LIGHTNING FAST - there’s absolutely no need to use the keypad unless you are giving a friend or visitor a temporary code to open.App is almost identical in feature/layout to the August App, which leads me to believe they ‘modeled’ it after that one, which I loved because I was used to it and it was very intuitive.Unlike the August Lock, the keypad and fingerprint here make all the difference. Also, U-Bolt has a ‘button’ in front of it to LOCK the ‘lock’ when exiting. With August, you had to either use the app, or ‘optional’ keypad, which I had purchased to ensure I’d never get locked out and to give other users access codes.With U-Bolt Pro that’s ALL-BUILT-IN right into the lock. And that fingerprint reader is faster than the ones that were on the iPhones - you just touch it for a fraction of a second, and puff, it unlocks - and no, it doesn’t get confused with just any other fingerprint.You can only store 2 fingerprints per user, but if you want to scan more for yourself, just create a ‘fake additional user’ and presto, but I can’t see why you’d need more than 2.I had a small issue where the Wifi bridge would install and operate the lock just fine remotely (as designed), but when looking at the bridge settings in the app, it’d read that the BLE SIGNAL = ’fail’ (Bluetooth).After a few communications with U-Tec’s support team, they identified the issue as something on their end and after a day or so fixed it - was impressed by that.A couple of negatives: the app does take a few seconds (nothing major) to connect with the lock over Wifi. If you are next to the lock the Bluetooth connection is faster.  However, it’s inconsequential, because you’d never bother looking for your phone, unlocking it, opening the app, wait for it to connect, and then unlock, when you can JUST PRESS FINGERPRINT READER FOR 1/3 OF A SECOND TO OPEN IT. And locking it from outside just requires pressing the front button. Also, for iOS, you do get a widget that gives you the LOCK/UNLOCK buttons without having to open the app.The other negative is the lack of a door-sense sensor like August, where the lock can detect if door is open or closed. It was handy because it wouldn’t auto-lock if it knew door was open. Plus it could notify you if door had been open for X minutes; OR, if you looked in the app, it’d track every time door was opened/closed (vs locked/unlocked), vs ‘CLOSED AND LOCKED’ or ‘CLOSED, but NOT LOCKED’, etc. Hopefully they’ll add that feature soon although I’d imagine it’d require a new unit.Still, I WOULD NOT HESITATE to BUY THIS LOCK AGAIN!!!!! Totally worth the money.5/19/21 UPDATE: U-Tec wrote to me and confirmed a new U-Bolt identical to this one will be released in June with a ‘Door Sensor’ to know when door is open/closed.",
    "page": 2
  },
  {
    "reviewerName": "Amazon Customer",
    "rating": 4,
    "title": "Great",
    "location": "the United States",
    "date": "August 8, 2025",
    "verifiedPurchase": true,
    "reviewText": "Just had this smart lock installed and it works great! I'm not tech savvy so I did struggle a bit setting up the app. Could not figure out how to set up my finger print. There was only instructions on how to set up fingerprints when  this lock is not added to the app. I had to watch a YouTube video to figure out how to add fingerprints after it was added to the app. After watching the video I got my thumb and pointer finger prints loaded Into the lock. You need the bridge to hook the lock up to wifi so you can control it when you're not home. So I highly reccomend getting that. Oh and the back up keys are great. Downside to keys is that they are difficult to copy. I took them to home depot and they said there's only a 50% chance the copied key will work. So I had her make me one key to see if it would work. And when I tried it on the lock it did work thank god. Anyways I love this lock and it was only 100 dollars. Mid range price is what I always get. Highly recommend.",
    "page": 2
  },
  {
    "reviewerName": "CTM",
    "rating": 5,
    "title": "Highly recommended!",
    "location": "the United States",
    "date": "August 4, 2025",
    "verifiedPurchase": true,
    "reviewText": "I am visually impaired and have difficulty with number pad only locks and even keys at times. I decided to buy a fingerprint lock and found the Ultraloq on Prime day. The lock was easy to install and setup and has wokred perfectly for a year and a half.  I can unlock it with my print or use Alexa or Google voice assistants. In addition to ease of locking and unlocking, I can ask the voice assistant to tell me if the lock is locked after I crawl into bed and have a moment of worry about the door being locked. The app is very good and sends a notification when the battery gets low and I keep the key in my wallet just in case.. Actually, this is the second Ultraloq I now have for another door. This lock had some mild resistance when operating the deadbolt so I contacted support and connected with Sally.  Support was great with quick responses and after a little back and forth, Utech sent me a part they thought would solve the problem.  Excellent product and support, not much more to ask for tha that.",
    "page": 2
  },
  {
    "reviewerName": "Justin Case",
    "rating": 4,
    "title": "Excellent product but I with the batteries lasted longer",
    "location": "the United States",
    "date": "September 9, 2025",
    "verifiedPurchase": true,
    "reviewText": "Awesome lock that works as advertised. Easy to install. Low to moderate difficulty to configure but is well documented and many YouTube videos to help you out. The app works fine. I would have gave it 5 stars but in the 2 months I've owned it I've changed batteries twice. I'm contemplating building  a external battery pack or running a wire to take care of that problem but I would recommend this product.",
    "page": 2
  },
  {
    "reviewerName": "R.T.",
    "rating": 4,
    "title": "There are times when the app shows that the unit is locked when it isn't and vise versa.",
    "location": "the United States",
    "date": "July 11, 2025",
    "verifiedPurchase": true,
    "reviewText": "UPDATE: The Customer satisfaction team reached out to offer to troubleshoot and send a full replacement if that is what I prefer. A+ for customer service.ADDED: I understand that there can be many factors that can lead to the issue(s) that I am experiencing such as weak signal from my wifi. The unit is 20 feet away from the main router and shows good signal as it reads on the app. I have reset to factory settings, updated the firmware and reinstalled. So far, I haven't seen any anomalies based on its specified capabilities for a good while. Increasing the star from 3 to 4.If  the door sensor is .5 inches apart from each other, it sends me a door open alert. That works fine. What I need is for it to alert me when it is unlocked for a certain amount or specified time. It does not have that capability on the software as to date.There are times when the app shows that the unit is locked when it isn't and vise versa. That's false security and is a big issue.",
    "page": 2
  },
  {
    "reviewerName": "Eddie",
    "rating": 5,
    "title": "Perfect smartlock with a plethora of features to suit most needs",
    "location": "the United States",
    "date": "December 1, 2020",
    "verifiedPurchase": true,
    "reviewText": "To start off, this is my 5th smartlock.  From cheap to expensive, so I have extensive use knowledge, comparisons against competitors, and integration experience (smart integrated house).  This lock is replacing a Kwikset Kevo and it's hands down a better lock.  It's cheaper and the version I bought included the bridge (with the Kevo the bridge was an additional cost of around $100).  I would say, with what I wanted, it's a perfect lock.  This lock is for the garage interior door (standard sized door including the deadbolt cutout)  and the objective behind a smart lock here is to assist with opening the door when hands are full and/or without a key/app in hand or opened.  We solely use this door for entry/exit and it's behind garage doors for decreased accessibility to the public.  The Kevo worked perfectly for this at first but as phones upgraded and security increased, the reliability of the blue tooth connectivity became less and less reliable and forced us to open the app to unlock the door at almost every use, defeating the purpose of a \"hands-free\" lock.  Other locks performed nearly identical in regards to blue tooth connectivity as the Kevo, likely due to infrequent updates and wide ranges of phone models.  This lock has great features, much more in comparison, and has 3 methods of preference.  Biometrics, PIN, and geo-based auto-unlock.  Biometrics seem to work flawlessly provided you set it up properly.  I've used them about 40 times at the time of writing this review without one issue.  PIN code works exactly as it should and does not require comment on this tried and true method (other than the PIN hide feature if you're paranoid someone is watching).  Finally, the Auto-Unlock geofencing.  This has worked perfectly so far.  I put the target in the middle of my house, even though the actual lock is near the house edge.  I did this to ensure that my house and backyard is covered in the radius so if I'm in either, it would keep the mode to back and not unlock if I leave the radius in my yard and re-enter causing the lock to unlock.  It works like this, once you've entered the radius, it will unlock and set your mode to \"Back\".  Once you leave the radius, it changes your mode to \"Away\", and the next time you re-enter the radius it will switch to back and unlock.  This ensures it's not unlocking once you're in your house and are within the radius.  This is intelligently designed and I'm confident that it's working as intended.  You can also set to receive notifications once the auto-unlock feature is triggered so you'd know if your distance from the lock is triggering an unlock.  I had someone assist in testing the range and it's pretty accurate.  The lowest setting is 300m but will go up to 600m and 1000m.  I do not use the auto-lock setup, but plan to once all the users of the door have PINs and fingerprints added, as it's time based but it is a good option as long as you have a PIN and/or fingerprint setup (so you wouldn't get locked out if you forgot your phone inside).  The included bridge runs on the 2.4ghz band (pretty standard for smart home appliances due to its range and compatibility) and should be within 10-15ft of the lock.  Mine has a full signal at about 12ft with a couch blocking the line of sight.  I do not use Alexa or other smarthome companions for home security devices so I cannot describe it's integration features/skills but I imagine it's like the other security devices and only allows you to lock and not unlock.  The only improvement I'd suggest is the nob on the interior mechanism.  It's black on black and you can't easily see if it's unlocked or not.  I plan to resolve this by dremeling a notch and painting the groove white to see its position.  All-in-all, I'm very happy with this lock and if ever phone security is interfering with the auto-unlock feature, the biometrics and/or PIN can be used for an easier access method.  I would recommend this every time someone wants to use a smartlock.SUPPLEMENTAL REVIEW - 7 Oct 2021Everything is still working perfectly.  Batteries were swapped 1 time over the year, so that's excellent.  In comparison, my other locks required multiple changes over the year.  No issues with it doing/not doing what was expected.  Due to COVID, I did turn off the geo-fencing since we work from home now.  The auto-lock is set to 10 minutes but we all have PIN and bio settings, no locked out people.  Issuing codes to others is easy and it works without issue.  Still 5 stars",
    "page": 2
  },
  {
    "reviewerName": "Lisa",
    "rating": 5,
    "title": "Customer service very helpful",
    "location": "the United States",
    "date": "August 11, 2025",
    "verifiedPurchase": true,
    "reviewText": "Have only had for about 2 weeks and at first i was not able to use the feature on the app to unlock and lock the door when I was away from home. I found out that I needed to do an update on the app for the lock and reached out to customer service and they were very helpful and friendly. At first, the update was not installing it kept failing, but then I realized that my Wi-Fi was not connected correctly and as soon as I made sure they were all connected then the update was installed, and I am now able to use all features in the app. Customer service is very quick and helpful if you ever need to reach out with any problems and they’re willing to Help you in anyway.  Now i am very happy with my purchase. Also very easy to install anyone can do it.",
    "page": 2
  }
]