[
  {
    "reviewerName": "Lay",
    "rating": 5,
    "title": "Excellent Smart Lock for Short Term Rentals",
    "location": "the United States",
    "date": "September 6, 2025",
    "verifiedPurchase": true,
    "reviewText": "I purchased 3 smart locks for our short term rental properties and installed them today. The setup was easy with clear instructions. The only challenge was that our old strike plate did not align properly, but it was a quick fix.What I appreciate most is the ability to track who locks and unlocks each unit. With different cleaning staff coming and going, it gives us peace of mind to see access logs and manage codes remotely. If anything changes, we can deactivate a code instantly.Another great feature is that I can create one access code that works across all units on the property. This makes it much easier for staff. The fingerprint recognition is fast and reliable, and the built-in WiFi means no extra equipment is needed.I noticed the price dropped by $25 shortly after I bought them, I hope I could get that discount. 🤣",
    "page": 1
  },
  {
    "reviewerName": "Hardhack",
    "rating": 5,
    "title": "Great lock for Google Home. Fingerprint sensor works every time. Batteries lasted for 11+ months.",
    "location": "the United States",
    "date": "July 19, 2025",
    "verifiedPurchase": true,
    "reviewText": "This lock was easy to install and set up with our Google Home.  It works well.  It locks automatically after 30 seconds.  It unlocks and opens easily with our fingerprints, so we never need to enter the numeric code.  The batteries have lasted for well over 6 months and they're still going strong.  That's one fewer key I need to carry.  I can also ask my Google Home devices if my door is locked, so I don't need to go to the door to check.UPDATE:  I installed this lock in September 2024.  It's now August 2025 and I just received my first \"low battery\" notification.  The original 8 Anker AA batteries that came with the lock lasted for almost a whole year of regular use in our front door.  I replaced them today with 8 Amazon basics AA batteries.  Replacing the batteries was super easy.  No tools were required.  The lock is still working great.  It locks and unlocks with our fingerprints quickly nearly every time.  It's so easy to use our fingerprints that we never use our code.",
    "page": 1
  },
  {
    "reviewerName": "Edwin Marrero",
    "rating": 5,
    "title": "Great product",
    "location": "the United States",
    "date": "August 9, 2025",
    "verifiedPurchase": true,
    "reviewText": "The Eufy C220 Door Lock has been a game changer for my home! Installation was straightforward, and the instructions were clear. I love the sleek, modern design—it looks great on my door. The smart lock works flawlessly with the app, and the fingerprint recognition is quick and accurate every time. I especially appreciate the convenience of unlocking the door remotely and knowing exactly when it’s been used. The battery life is impressive, and I feel much more secure with it in place. Highly recommend this lock for anyone wanting both style and security in one device!",
    "page": 1
  },
  {
    "reviewerName": "Kailey",
    "rating": 4,
    "title": "Great lock overall!",
    "location": "the United States",
    "date": "July 25, 2025",
    "verifiedPurchase": true,
    "reviewText": "I have had this lock since December of last year. Currently in July, it is still working without having changed batteries or having any problems at any point during its time on my door. It is made out of metal which makes it feel durable and well made, and the finger print sensor works well as long as your finger isn’t wet. The phone integration is incredibly useful, as I can ensure my door is locked from anywhere and make schedules for ease of mind. It was also no more difficult to set up than a normal lock and gave no problems connecting to my phone. It is also extremely nice to have the ability to use a key in the event that the technology stops working. The only problems I have with this product are the fact that it gets very hot if the sun is hitting it (although this doesn’t impact its performance) and the touch screen has no physical impressions of the numbers so you need to see them to hit them correctly. Overall, this product is a great value and I would recommend it to anyone looking for a cheaper smart lock.",
    "page": 1
  },
  {
    "reviewerName": "Herbie W.",
    "rating": 5,
    "title": "Everything about it is easy! Good quality, affordable.",
    "location": "the United States",
    "date": "September 5, 2025",
    "verifiedPurchase": true,
    "reviewText": "Got these to replace Schlage Sense locks that just crapped out on me after 5 yrs. I hated that it required a WiFi bridge unit, which was clunky at best and a *itch to setup.SUPER EASY INSTALLATION AND SETUP! Took about 10-15 minutes per lock. The app works intuitively, and made lock setup simple.Easy to change codes, setup fingerprints, and add separate PINs for each user who needs access. BUILT-IN WiFi so no need for a WiFi bridge... just connects directly to your home WiFi router.App notifications when doors are locked/unlocked is almost instantaneous.Seamlessly connects to Alexa. I haven't tried Google Home or others.For the current sale price, this is hard to beat!",
    "page": 1
  },
  {
    "reviewerName": "Carla",
    "rating": 1,
    "title": "Eufy’s “Security” System Is a Dangerous Joke. Weak Alarm, Misleading Info, and Useless Support",
    "location": "the United States",
    "date": "June 4, 2025",
    "verifiedPurchase": true,
    "reviewText": "I spent over $400 on what I thought was a full Eufy home security setup. I bought the HomeBase 2, the 5-piece sensor kit, smart lock, doorbell camera, outdoor camera, chime, and more. I expected to feel safe in my home. Instead, I got a system that can barely be heard and a support team that doesn’t even understand how their own products work.Only the HomeBase 2 makes a sound when the alarm is triggered. None of the sensors, cameras, or other components ring. Just one small box with a 100 dB siren sitting upstairs next to my router. I live in a two-story home. One day the alarm rang for hours and I didn’t even notice. Neither did my neighbors. What kind of security system is that?When I contacted customer service, I explained everything clearly. I gave them the facts, the issue, and the exact solution. Their replies were insulting. They asked me if I had tried turning up the volume. I had. They told me to try different alarm tones. I had. They told me to move the HomeBase, even though I clearly said it had to stay next to the router. Then they told me to use my doorbell camera as a siren, which is connected to a chime and would go off with every passerby. It’s not even linked to the HomeBase alarms. That suggestion made no sense at all.Then came the most ridiculous part. They actually asked me if my house had walls. Yes, my house has walls. That’s how houses work. If your product can’t be heard through a wall, it’s not fit to be called a security system.It got worse. They asked if my motion sensors and entry sensors made noise. These devices do not emit sound. They never have. It’s shocking that their own support team doesn’t even know how their products function. That’s basic information and they clearly didn’t have it.They also told me Eufy doesn’t make a separate siren. I had to send them a link to their own siren listed on Amazon before they even acknowledged it existed. I asked for two of them to be sent to me as a fair resolution. After dodging the request with emotional reassurances and irrelevant replies, they just stopped responding.To make things even more frustrating, one of the cameras I bought wasn’t compatible with the system. I only found this out through trial and error, because the product description doesn’t mention it. Nowhere does it say it won’t work. That’s on them.There’s no actual customer service number. You’re left emailing support reps who don’t read your messages, don’t know the products, and give you useless copy-paste responses while stalling you into silence.I handed them the solution. I explained the problem from day one. I did all the work for them. The moment I had an airtight case and knocked down every excuse they had, they disappeared.If you want a system that’s reliable, loud, and backed by people who care about your safety, this isn’t it. The design is flawed, the listings are misleading, and the customer service will waste your time until you give up. I regret buying this. You will too.Update: After weeks of trying to work with Eufy support, I was offered a refund that doesn’t even cover the cost of fixing the problem. I asked for two sirens so the system could function properly, or a refund to cover the actual price. They refused both and closed the case. Since I pointed out the siren was on Amazon, it was suddenly removed and now only shows up on their website. I gave them every chance to resolve this and they chose not to. Think twice before trusting this system to protect your home.",
    "page": 1
  },
  {
    "reviewerName": "Brad Nickel",
    "rating": 5,
    "title": "Great lock that makes life easier for everyone, including me.",
    "location": "the United States",
    "date": "April 27, 2025",
    "verifiedPurchase": true,
    "reviewText": "Great price for a solid well designed product.I looked at a number of locks like this one, but none matched the features, price and quality I wanted. This is my first Eufy product and so far so good. High quality and a pretty easy install and setup.Make sure this will fit properly in your door. See the measurements provided by the company.The app is really pretty easy to use and I love the auto locking feature and the ability to temporarily assign a code to the person that takes care of our cats while we are away. It keeps a log of all the ins and outs and it also had alerts that let you know if the lock is being used. I need to take the time to fix the weather stripping our door so it closes completely, because sometimes the lock can't lock because the door is not fully closed. That is the fault of the door, not the lock and the cool thing is that the app tells me when it tries to automatically lock and failed.The only negative I have seen is that on a rare occassion, the lock seems to glitch when I go to lock it when leaving the house. I just wait a beat and then put my thumb on it again and it works great.The lock looks great and seems to be well built. We use it with Alexa as well and it was easy to integrate into the Alexa app.Fingerprint recognition is the same as what you do on the phone and it has never failed for any of us.We no longer have to worry about making keys or losing them, but it does come with a key in case there is an electical issue of some kind.I am really happy with this purchase from a price to quality and features perspective and highly recommend it.",
    "page": 1
  },
  {
    "reviewerName": "Brian",
    "rating": 5,
    "title": "Great Battery Life",
    "location": "the United States",
    "date": "September 5, 2025",
    "verifiedPurchase": true,
    "reviewText": "I have had my Eufy for over a yer now.  The batteries lasted 374 days (1 year and 9 days) - same batteries it came with (it takes 8 AAs).  The reviews I read before purchasing the Eufy commented a lot about poor battery life - Eufy claims 8 months.  When I bought the Eufy, one of the reviews suggested if the WiFi signal was weak, battery life can be affected.  My experience was positive in this regard.Otherwise, the Eufy is easy to operate, and it integrates well with the Eufy app.  The fingerprint or code option is good.  For those who are more data conscious, it is not mandatory to use the fingerprint option.  Installation was easy - the instructions were clear.",
    "page": 1
  },
  {
    "reviewerName": "Ken Schaefer",
    "rating": 5,
    "title": "A Smart Lock That Nails Convenience, Security & Style",
    "location": "the United States",
    "date": "July 2, 2025",
    "verifiedPurchase": true,
    "reviewText": "after a week or so of using this lock, I felt compelled. Simply put: this smart lock delivers on every promise, and then some.Install? Surprisingly SimpleI’m no handyman, but with a Phillips screwdriver, the install took under 30 minutes. The included instructions were clear, but I also pulled up eufy’s YouTube guide for reassurance—super helpful. I didn’t need to drill anything new since it fit perfectly into my existing deadbolt space. Just measure before buying, and you’re golden.Security & Smarts Without ComplicationThe fingerprint sensor is lightning fast and scarily accurate. I’ve tested it with slightly wet hands, post-workout hands, even my 9-year-old’s tiny fingers—no failures yet. I love that I can add multiple users and control everything from the eufy Security app, which is intuitive and well-designed. The app lets me:Lock/unlock remotelySee a full access log (great for knowing when my dog walker shows up)Set up temporary or recurring codes for family, guests, or Airbnb situationsBattery Life & Fail-safesSo far, the battery life is holding strong. After regular daily use, the battery indicator still reads as “full.” I also love the peace of mind from having multiple backup access methods:Physical keyNumeric keypadUSB emergency power port (huge win if the batteries ever die unexpectedly)Design & Build: Looks as Good as It WorksI went with the Nickel finish—it’s sleek, modern, and feels premium. It doesn’t scream “tech gadget,” which is great for curb appeal. It has a reassuring solid build, and the keypad lights up beautifully at night.Bonus Features I Didn't Know I NeededAuto-lock timer (I never forget to lock the door now—thank you, ADHD mode!)Door status detection lets me know if it’s left ajarIntegration with Alexa/Google Assistant means I can unlock via voice with a PINQuiet motor compared to other locks I’ve testedFinal Verdict: Zero RegretsIf you’re tired of fumbling for keys or wondering whether you locked the door after leaving the house—this is your solution. It’s a smart, stylish, and rock-solid upgrade. I’d buy it again in a heartbeat, and I’m now looking at getting a second one for the back door.Highly recommended for homeowners, Airbnb hosts, and tech-savvy renters alike. This lock just works.",
    "page": 1
  },
  {
    "reviewerName": "Caiden",
    "rating": 4,
    "title": "So far so good!",
    "location": "the United States",
    "date": "August 22, 2025",
    "verifiedPurchase": true,
    "reviewText": "It looks good, works fine, and is more secure than our original deadbolts. Being able to check that the door is locked on the app is awesome as well as being able to lock/unlock it. You can also set a code to expire on a certain date which is awesome if you have temporary employees, interns, are out of town etc.The fingerprint option can be a bit finicky as others have mentioned but it’s really not a big deal given that you can also use the code. Some of it may be operator error as well as folks have a hard time remembering if you hit the check mark, don’t hit the check mark etc.I got two of them on sale for a total of about $200. Feels like a solid deal.",
    "page": 1
  },
  {
    "reviewerName": "KS",
    "rating": 5,
    "title": "Attractive and well built product.",
    "location": "the United States",
    "date": "August 21, 2025",
    "verifiedPurchase": true,
    "reviewText": "Sleek attractive product. The installation of the lock portion was pretty straight forward, however I ran into a problem. 1 of the 3 screws that holds the rear mechanism part with the batteries never screwed in. It never felt like it even started to thread. When I went to remove the whole unit to see what was going on, the mechanism housing somehow locked to the backing plate. I was not able to get it back off so I just attached it with the 2 other screws.  The door handle was a bit odd, as it came setup for the handle to be set vertically. I just mounted it without trying to figure out a way to reconfigure it. The software setup for the lock was extremely easy.",
    "page": 2
  },
  {
    "reviewerName": "HBD",
    "rating": 5,
    "title": "Great handle and keypad!",
    "location": "the United States",
    "date": "September 12, 2025",
    "verifiedPurchase": true,
    "reviewText": "It took a bit to install but that was mostly because of the old door I needed to retrofit. The handle and lock set are great. Instructions were clear. I really like the auto lock option on the app - it will lock the door after 5 minutes if I forget. The quality seems excellent and it was $100 cheaper than the Schlage model I was considering.",
    "page": 2
  },
  {
    "reviewerName": "Jean Pierre Arazo",
    "rating": 5,
    "title": "👍🏻",
    "location": "the United States",
    "date": "September 7, 2025",
    "verifiedPurchase": true,
    "reviewText": "I have more than 8 months using this lock, is very easy to install, easy to use, the app allow you to create different a profile and or temporary codes for visits!. You can recurve notifications about who enter or when somebody is going out. In all those months I had no problems at all with it and still working just as the first day!",
    "page": 2
  },
  {
    "reviewerName": "vcastro85",
    "rating": 5,
    "title": "Awesome smart lock for the price!!!",
    "location": "the United States",
    "date": "August 30, 2025",
    "verifiedPurchase": true,
    "reviewText": "Everything worked as intended. Multiple fingerprints worked and the keypad had no issues. Locking mechanism was solid. The color matched the image online. The product is flawless but one feature I’d suggest to be changed. The auto locking feature should auto lock when the door is closed only. The feature states auto locking, which is nice, but it will auto lock whether the door is closed or not. Definitely not practical but since the feature works as intended, it gets 5 stars.",
    "page": 2
  },
  {
    "reviewerName": "Varun Garg",
    "rating": 5,
    "title": "Great Quality. Highly recommended!!",
    "location": "the United States",
    "date": "September 15, 2025",
    "verifiedPurchase": true,
    "reviewText": "Really great quality and awesome features. Fingerprint lock, numeric lock and hard key lock along with controllable via phone .I am using this as primary lock along with Kwikset as secondary lock.",
    "page": 2
  },
  {
    "reviewerName": "Daniel",
    "rating": 5,
    "title": "Love the fit and finish, the app, the functionality",
    "location": "the United States",
    "date": "June 28, 2025",
    "verifiedPurchase": true,
    "reviewText": "I’ve been using this Eufy smart door lock for a few weeks now, and I’m genuinely impressed. From the moment I took it out of the box, the quality stood out. The finish looks sleek and modern, it adds a really clean, premium look to the door. It feels solid and well-built, not cheap or flimsy like some other smart locks out there.Installation was straightforward. The instructions were clear, and the whole process took less than 30 minutes with just a screwdriver. I didn’t run into any surprises, which I appreciated.The fingerprint sensor is one of the standout features. It’s fast and accurate. I’ve tested it dozens of times and it unlocks almost instantly with just a light touch. No lag, no failed attempts. It just works, even when my hands are a little sweaty or damp.Battery life so far has been excellent. I haven’t needed to charge it yet, and the app still shows a strong battery level after regular daily use. I also love the app. It’s clean, easy to navigate, and packed with features. I can add or remove users, see a full lock history, and get notifications instantly when someone unlocks the door. Remote access works flawlessly too.Overall, this lock checks every box: great design, long battery life, smooth installation, fast and reliable fingerprint recognition, and a fantastic app experience. If you’re looking to upgrade to a smart lock, this one is absolutely worth it.",
    "page": 2
  },
  {
    "reviewerName": "kristen",
    "rating": 5,
    "title": "Wish I'd bought it sooner!",
    "location": "the United States",
    "date": "August 19, 2025",
    "verifiedPurchase": true,
    "reviewText": "This device works perfectly! The unlock feature is just short of instant, the lock can be manual or automatic with the timer being set by you. It's sleek and clean looking. I love that the app has a lock/unlock from your phone feature for even easier entry!! Ice had it 2 months with no issues and it has remained functional through heat and rain storms etc. This is durable and a wonderful addition to your home security setup.",
    "page": 2
  },
  {
    "reviewerName": "David Ellis",
    "rating": 5,
    "title": "2nd House, 2nd Eufy Smart Lock!",
    "location": "the United States",
    "date": "September 7, 2025",
    "verifiedPurchase": true,
    "reviewText": "Installation was a breeze. The only problem I had was the hole on my foot frame that the dead bolt went through. After some professional, unlicensed handy work, she glides like a charm!",
    "page": 2
  },
  {
    "reviewerName": "Michael",
    "rating": 4,
    "title": "Minimal issue",
    "location": "the United States",
    "date": "August 28, 2025",
    "verifiedPurchase": true,
    "reviewText": "Great smart lock with minimal issue.  I’ve deleted a family members code…. Yet it unlocked & locked but showed manual locked.  She doesn’t have a key.",
    "page": 2
  },
  {
    "reviewerName": "KeyAiria",
    "rating": 5,
    "title": "Great!",
    "location": "the United States",
    "date": "September 10, 2025",
    "verifiedPurchase": true,
    "reviewText": "I love it. Multiple ways to use it. The app lets me know when the door was locked and unlocked. Overall great!",
    "page": 2
  }
]