[
  {
    "reviewerName": "Ravi M.",
    "rating": 5,
    "title": "High quality product provides great value",
    "location": "the United States",
    "date": "August 3, 2025",
    "verifiedPurchase": true,
    "reviewText": "Great product that was easy to set up and install. Both WiFi and BT connectivity are reliable and very convenient. Light is bright and overall very high quality. It's great that it is compatible with various assistants and also can be controlled through Govee Home app where I have other devices. It's a bit higher price but I think reliability and quality of Govee products makes them a great value.",
    "page": 1
  },
  {
    "reviewerName": "Geyoga Geyser (Blows)",
    "rating": 5,
    "title": "Great, long lasting lights at a great price. Programmable and customizable. Very nice touch.",
    "location": "the United States",
    "date": "June 16, 2025",
    "verifiedPurchase": true,
    "reviewText": "These are great bulbs. Huge range of colors. Really easy to use with the Govee app and it integrates into your Google Home app pretty seamlessly once you've connected your devices. Each light connects to your network, so if you're limited on the number of devices based on your available Internet plan, that may become an issue for you.I used two of these for a while - one in my living room adjacent my aquarium, and one in my bedroom. I initially wanted them just to have an easily dimmable bulb that I didn't have to fuss with or cycle through half a dozen options for brightness when I can just slide a bar and select it's brightness through the app. You can turn on and off the switch that's related to where your bulb is connected and, while you can't turn on the light if the switch is \"off,\" when you turn your switch back to \"on\" the light comes back on with the same settings and brightness that it was on before hitting the switch to \"off\" meaning - unlike some other smart bulbs I've used - the settings on the bulb do not reset. You can also move a bulb from one light fixture to another and it will also remember the network it was connected to and it will also have the same settings that have been saved for the light.The app allows you to create your own scenes or gradient lights with whatever colors you want. They have a color match option where you can take a picture of a color and then eyedrop the color from said picture and input it into the Govee app and save it as a color for your light and it does a pretty decent job at matching the colors.I don't know how I managed to do it, but I was able to find a pure white and even a pure \"black\" light. They're the lowest possible colors I can find on the entire spectrum that dims well below the 1% brightness of any of the standard ranges of white lighting, be it a soft yellow or a loud white. The white is almost gray and the \"black\" is one of the eeriest, darkest oranges you'll probably ever see in a light bulb and it's a fraction of the luminosity. As a matter of fact, my candle puts off about 5x the luminosity as the bulb does at its lowest/dimmest setting that I've been able to find. It's quite lovely when you're laying down in the evening.For the algorithm!!!!! The warmth of the light varies from hot to cool. You have the full range of white light variants that you'll see in all of your standard bulbs.The fit is that of any other standard 60w light bulb.There is no noise level unless you say, \"Hey, Google, turn on my living room light\" and she says, \"Okay!'.And as far as durability goes, I can say, without a doubt, that these bulbs are far more durable than a standard glass bulb. The bulbs are more of a plastic, where it would collapse much more similarly to a crushed ping pong ball than a shattering glass light bulb. They don't get hot and I seriously doubt you'd ever have a fire hazard because of them. You're more likely to have a breaker issue or wiring issue with your home than these bulbs. To further elaborate on the durability of the bulb, as odd as it seems, it doesn't feel like you'll overtighten the bulb to the point where it would break or separate. I'm fairly confident that if you drop it from the ceiling to the hard wood floor it would just bounce and still work just fine.You can setup automation in the app. Say you wake up at 630 am, you can align the light to come on with your alarm, so even if your lazy butt doesn't want to get up and you yell \"snooze\" across the room, you still have to deal with the light. It does actually help some days, even if you're dragging yourself and falling out of bed. You can also set the lights to turn off at your set bedtime. Like \"dim my phone screen at 10pm\" you can automatically have the lights \"turn on\" to a lower brightness or you can have them turn off completely. The lights will also pulse with music if you like that option.There are a lot of ways to customize your light set up with the app. I don't go too seriously in depth with it, but enough to know that it's worth using with a very small learning curve.One thing I will say as a bit of a forwarning: if you buy these light bulbs and then you purchase another Govee light, such as the TV light strips, the cupboard light strips, or the standing lamps, expect the same saved color to appear slightly differently on each device. Now, every single device that is the same will show the same color, but if you compare the tv light to the light bulb, the same orange tint of a saved color will sometimes appear more orange in the bulbs, but a little more yellow on the tv light. This is based mostly on the layout of the lights and layout on the strips, where the colored bulbs actually lie, and the fact that it's more limited by size than a regular smart bulb. I believe each light node is restricted by the amount of colors it can produce, so it does its best to match the color with much more limited capabilities. That being said, with a little finesse, you can save a slightly different orange to your TV light with a slightly darker orange for your living room lights and you can get them to be really, really close at the right brightness. With a little tinkering, at the right shade and brightness, you can't tell the difference. Overall it works well, kind of fun to play with, and I think they have convenience settings like lights on/off for sunrise and sunset or times you specifically set. The rest mode will take a light at whatever temp and brightness you want and it will reduce the brightness gradually to 0 over the course of 10 minutes. So you can go from reading for a few minutes, to putting your book down, getting comfortable, and before you know it, light's good and gone.",
    "page": 1
  },
  {
    "reviewerName": "Wanderer",
    "rating": 5,
    "title": "Fanatastic Smart Bulbs",
    "location": "the United States",
    "date": "November 12, 2024",
    "verifiedPurchase": true,
    "reviewText": "I have purchased several different manufacturer's bulbs since IoT lighting became a thing. This is the first set of bulbs I can say worked flawlessly the first time during setup. I have only had these bulbs a day as replacements for my last manufacturer's bulbs, but with the easy setup, which took about 2 minutes per bulb (assuming you already setup the 2.4Ghz wifi), the intensity/brightness of the bulbs and the color vibrance of the bulbs make them an excellent choice.I read a comment while researching bulbs in the last couple of days where a person stated, \"the biggest stability problem with IoT devices is always the lighting\". I am here to say, these bulbs are the exception to problematic lighting. I am sure they may have a bad one here and there but not in my experience so far. In fact, I just finished ordering bulbs to replace my entire house and am considering some new lighting fixtures as well. The ease and simplicity of setting up the test bulbs is enough to get me to commit. If issues arise later, I will be back to change this review but not right now.Their app, Govee Home, works well (I am running on iOS). The control and setup screens are different than what I have used in the past but once you begin using it, it makes a lot of sense and is easy to use. It has also been quite stable. Again, I have only been using them a short time but I have experienced positive things with Govee which I have not had experienced with any other bulbs/lighting in IoT.One last item, I found these bulbs to be a bit, not much, but a bit heavier than many of the current production bulbs by many other companies. I did have that same consideration with one other company before they went to a lighter weight bulb which had a significantly higher failure rate compared to their older style bulbs. So I am hoping for the best for the Govee bulbs as I have certainly had pleasant experiences so far.",
    "page": 1
  },
  {
    "reviewerName": "ObsidianX",
    "rating": 5,
    "title": "A great smart light option.",
    "location": "the United States",
    "date": "September 1, 2025",
    "verifiedPurchase": true,
    "reviewText": "Love these lights.  Very easy setup with Bluetooth connectivity.  The Govee app sensed them immediately.  Was able to add them to my Google Assistant in less than a minute.  Bright, colorful and zero flickering up and down it's brightness scale.  Highly recommend it's initial quality.",
    "page": 1
  },
  {
    "reviewerName": "Matthew C.",
    "rating": 5,
    "title": "Govee Delivers Solid Smart Lighting Without Breaking the Bank",
    "location": "the United States",
    "date": "May 27, 2025",
    "verifiedPurchase": true,
    "reviewText": "Let’s get the obvious out of the way: if money is no object and you want top-tier smart lighting with rich integrations and full color control, go with Philips Hue. But when I needed at least 24 A19 bulbs, the cost of Hue alone was pushing $1,000 and that’s before adding the BR30 bulbs and required hub. Altogether, I was looking at nearly two grand just to light my new house. I wanted a smarter, more affordable approach that didn’t sacrifice quality.Enter Govee.A few weeks back, I spoke with a business owner who specializes in smart lighting installations. He mentioned he now exclusively works with Govee products and that was all the endorsement I needed to give them a shot.There are currently two “current” versions of Govee’s A19 bulbs available (as of this writing): a 1000-lumen version and a 1200-lumen one. Anything else is outdated. The brighter option costs more than double the price per bulb ($19 vs. $8.50 at the time of purchase). Since both run on the same 2.4GHz Wi-Fi + Bluetooth tech, I chose the 1000-lumen bulbs and saved over $250. For the price, they’re surprisingly bright and very capable.Setup was quick and painless. Honestly, screwing in the bulbs took longer than getting them online. You connect via Bluetooth through the Govee app, and from there, you can get the bulbs to join your Wi-Fi network instead. That said, the app itself could use some polish. It works, and the controls are intuitive, but the interface feels a bit like a no-frills knockoff brand.Once the bulbs are up and running, though, they perform great. Color changing is smooth, and they integrate nicely with Alexa and Google Assistant (though not HomeKit). While you won’t get all the advanced features outside of the Govee app, basic smart home automation works just fine.Bottom line: if you’re willing to spend thousands on lighting, Hue is the gold standard. But if you’re looking for solid performance at a fraction of the cost, like I was, Govee delivers. I outfitted 24 A19 and 12 BR30 bulbs for around $300, and I have no regrets.",
    "page": 1
  },
  {
    "reviewerName": "Madison",
    "rating": 5,
    "title": "Absolutely the best",
    "location": "the United States",
    "date": "February 3, 2025",
    "verifiedPurchase": true,
    "reviewText": "This is not a paid or solicited review.FIrst-off, I would like to say that I have been through MANY smart bulbs in the past few years from many brands. GE, Wyze, Amazon, Philips...etc, I came across Govee while looking at their permanent outdoor lights (Still haven't pulled that trigger yet). However, I purchased one bulb as a test to see if they were better than what I had. Here are my Pros and Cons for this product.Pros:-Connection was super simple, after screwing the bulb in the app automatically recognized it with no issue (All other competitors are more difficult).--The app is very user friendly and connects your device(s) to Alexa seamlessly.-The bulb(s) reconnect to WiFi automatically after loss. (This happened to me 20 minutes after install, ISP issue, not the bulb (For context, I had to go around my house 1-by-1 and reconnect all other IoT devices)).-Very Bright, perfect for any room.-SO MANY COLORS.-Music sync feature may not be something I'll use too often, or at all, but it is still a cool feature to have.Cons:-Only connects to 2.4Ghz WiFi. (While this isn't a deal breaker in any sense. I would like the ability to spreadload my WiFi connections and not over saturate my 2.4 network. (Just a personal preference)).-------------------------------------------------------------------------------------------------------------------------After installing the first bulb, I needed more so I ordered 4 more bulbs. After installing the bulbs in the lamps in my living room my partner mentioned that they didn't get AS bright as they would like so I'm upping the lumens and getting 2 more at 1200 lumens. For me however, the 1000lumen bulb is perfect. I now have them installed in my living room, bedroom, and my office. Looking at more products from this company as I'm very happy with the quality and ease of use for these products.",
    "page": 1
  },
  {
    "reviewerName": "dp",
    "rating": 5,
    "title": "replaced sengled. great choice.",
    "location": "the United States",
    "date": "August 27, 2025",
    "verifiedPurchase": true,
    "reviewText": "replaced my sengleds. i was already used to smart bulbs and connectivity with alexa so my opinion of this bulb is based on the bulb not just the ability. i found that these connected extremely easy and fast. so much so that i almost thought i did it wrong. one is in house and the other is outside for a porch light (fixture enclosed, not an outdoor bulb). the connection is strong and without trouble. colors are nice and react fast. i should have switched to these a long time ago.",
    "page": 1
  },
  {
    "reviewerName": "Andrew",
    "rating": 5,
    "title": "Easily schedule lighting without having to remember to turn them on/off.",
    "location": "the United States",
    "date": "September 2, 2025",
    "verifiedPurchase": true,
    "reviewText": "I've been a fan of Govee for a while now. Their app is easy to use once you get familiar with it. I use these for my outdoor lighting and it's convenient to be able to schedule them to turn on at sunset and off at sunrise.The light bulbs themselves are easy to connect to Wi-Fi and Bluetooth. They have a variety of lighting options to choose from. I typically use candlelight for a nice ambiance, but it's convenient that I can change it to a normal white light if I need to see the area better at night. I also have one in my bedroom that works nicely as a reading light or nightlight.The lifespan so far has been great and the compatibility with Google Assistant (or Alexa) makes it easy to turn the light on without having to reach for my phone.",
    "page": 1
  },
  {
    "reviewerName": "Cj Clark",
    "rating": 5,
    "title": "Definitely recommend.",
    "location": "the United States",
    "date": "August 19, 2025",
    "verifiedPurchase": true,
    "reviewText": "I love these lights. For the relatively inexpensive price point they work very well. I just screwed them in and connectivity was super easy through the Govee app. Super easy. I bought them originally to put in a set of track lights to connect to the Dreamview along with my tv strip and light bars for a more immersive movie watching experience and they look amazing. I also bought a set for the light track on the opposite wall. The only issue I had was that were was some flickering due to the tracks being on dimmer switches. All I needed to do was replace them with toggle switches since they are dimmable through the app anyway. I also wish they could be connected to a hub so I don’t have as many devices attached directly to Wi-Fi. At any rate, They look great and are energy saving. I am definitely thinking about replacing all of my lights with them at this price point.",
    "page": 1
  },
  {
    "reviewerName": "Steve",
    "rating": 5,
    "title": "Love these GOVEE wi-fi A19 1000LM Color Changing Bulbs!",
    "location": "the United States",
    "date": "July 14, 2025",
    "verifiedPurchase": true,
    "reviewText": "Love these GOVEE wi-fi A19 1000LM Color Changing Bulbs!Although I was a bit weary about wi-fi bulbs as range may be an issue and they need their own IPs and really didn't want to change my subnet mask, but ended up doing that for other reasons, so it worked out fine (static IPs for me).So far I have (8) A19 1000LM H606 wi-fi bulbs, and (6) are out-side and all set to soft white at 20% keeping a nice glow at the front, side and around the garage and no connectivity issues at all. The (2) farthest bulbs are at the back of my garage in glass fixtures, about 40-60 feet away from my router that's in my basement. WOW! Didn't think that would work. I also have the RING door bell working with Alexa to turn them on/off and notify me on my phone and echo devices when the doorbell/detection occurs. Works great!Set-up is super easy, but for me an extra step setting up static IPs (my choice vs DHCP). The app is awesome (blue-tooth), for special lighting/music effects but I normally just use soft white and occasionally change to colors when movie/game-time, so stream-lining voice commands with Alexa is simple and fast. Still learning the app :)Lighting Wish List: Everything GOVEE Wi-FiWhy I went GOVEE... Currently have about (30+) S*****d bulbs that had (2) hubs (had to replaced both), but with that brand I keep losing Alexa connectivity (app works fine) so they are now being replaced.Thanks for reading.",
    "page": 1
  },
  {
    "reviewerName": "Kathy Rose",
    "rating": 5,
    "title": "Govee is easy to install and fun to use!",
    "location": "the United States",
    "date": "August 20, 2025",
    "verifiedPurchase": true,
    "reviewText": "Easy to install and setup. Unfortunately not as easy to connect to Alexa because I think you now have to set it up as a routine since it's a third party app. All despite this, was able to get the Govee app running with this light bulb in just about 3 minutes or less, as soon as I switched on the light my app was saying I had something new connected and bam!! it was done.  The bulb is good quality, not worried about it breaking easily, it's a heavy bulb due to the mechanics and will be super fun for the holidays. I've purchased this bulb before and given it as a gift. I have several Govee products connected and love them all!!",
    "page": 2
  },
  {
    "reviewerName": "Robert Stone",
    "rating": 5,
    "title": "Solid for price",
    "location": "the United States",
    "date": "September 9, 2025",
    "verifiedPurchase": true,
    "reviewText": "Solid quality for the price if you can find it on sale, standard size for my ceiling fan, easy to connect to, reasonably bright though if you’re thinking about it, go for the 1200lm because these could be brighter.Picture quality’s solid, easy to connect to with the app, Alexa, & Siri, & overall very functional; no issues yet.",
    "page": 2
  },
  {
    "reviewerName": "Kim Ders",
    "rating": 5,
    "title": "Worth it!!",
    "location": "the United States",
    "date": "September 4, 2025",
    "verifiedPurchase": true,
    "reviewText": "The easiest, quickest, install and pairing with Alexa of a lightbulb brand I have had. Worth the money simply for the no hassle Govee app, no fee on the app, fun lighting design options, and simple instructions. This literally took less time to install 8 light bulbs and have them up and running that it did for one of another brand that never worked at all. Highly recommend!",
    "page": 2
  },
  {
    "reviewerName": "Stephanie Lucy Weaver",
    "rating": 5,
    "title": "Best smart light ever!",
    "location": "the United States",
    "date": "August 24, 2025",
    "verifiedPurchase": true,
    "reviewText": "These are the best smart lights I've ever bought. The other brands over time would randomly stop working or took too much effort to set up. But these lights so simple and easy, no headaches and can usually have them set up in less than 5 minutes. It does all the colors and gives you the option of what kind of white light you want, \"yellow\" white or \"bright\" white. I'll never buy any other smart light again.",
    "page": 2
  },
  {
    "reviewerName": "TA",
    "rating": 5,
    "title": "1000 lumen Govee Bulbs are the sweet spot - DON’T buy the 1200 lumen version",
    "location": "the United States",
    "date": "August 19, 2025",
    "verifiedPurchase": true,
    "reviewText": "Great bulbs, app works well, WiFi and Bluetooth work well, love them.  I own the 800 lumen, 1000 lumen (these), and 1200 lumen Govee bulbs.  The 1000 is all I’d ever buy moving forward.  They are a lighting upgrade over the 800 lumen.  The 1200 bulbs are indiscernible from the 1000 lumen in degree of brightness making the 1200 lumen a complete waist of money at almost double the cost of the 1000 lumen bulbs.  This 1000 lumen Govee bulb on the other hand I’d highly recommend.",
    "page": 2
  },
  {
    "reviewerName": "TheOfficialJW",
    "rating": 5,
    "title": "Amazing 😍",
    "location": "the United States",
    "date": "September 6, 2025",
    "verifiedPurchase": true,
    "reviewText": "Love it so much that every smart light is a Govee bulb!! The light quality is amazing and the color schemes make it worth it! When it comes to connectivity and compatibility it works seamlessly with my Google Home and Alexa as well.",
    "page": 2
  },
  {
    "reviewerName": "Pauline",
    "rating": 5,
    "title": "Great Lightbulb",
    "location": "the United States",
    "date": "August 18, 2025",
    "verifiedPurchase": true,
    "reviewText": "First time using these lights. They came highly recommended by family. I purchased these lights to keep my pet from being in the dark while I was out and about. I use the timer feature (which I love). I can also manually turn on and off the lights when needed. Also, selection of colors is amazing. If you just want white lighting, the illumination is great. I highly recommend. Setting up the app and lights was super easy.",
    "page": 2
  },
  {
    "reviewerName": "0809",
    "rating": 5,
    "title": "Great quality",
    "location": "the United States",
    "date": "August 29, 2025",
    "verifiedPurchase": true,
    "reviewText": "Got these to replace Wyze lightbulbs because those didn’t keep the settings we put for them.  So far these new Govee bulbs are amazing!!  Super easy to program and they maintain the settings to turn on at ought and off in the morning.  Great color choices too.",
    "page": 2
  },
  {
    "reviewerName": "Samuel",
    "rating": 5,
    "title": "Amazing light bulb",
    "location": "the United States",
    "date": "September 2, 2025",
    "verifiedPurchase": true,
    "reviewText": "i just want to say. this light bulb are amazing. Super cheap and amazing quality. I love them. i love the setting y the thing you can do with them. best light bulb a have ever had. 100% recommended.",
    "page": 2
  },
  {
    "reviewerName": "Divuad Molek",
    "rating": 5,
    "title": "Easy setup",
    "location": "the United States",
    "date": "September 15, 2025",
    "verifiedPurchase": true,
    "reviewText": "These Govee brand lights are my favorite for lighting and home automation projects. Easy to setup and go.",
    "page": 2
  }
]